
def area(a):
    """
            Вычисляет площадь квадрата

            Параметры:
              a(int) : длина стороны квадрата

            Возвращаемое значение:
              area(int) : площадь квадрата

            Пример вызова :
            area(10) # вернёт 100

        """
    return a * a


def perimeter(a):
    """
        Вычисляет периметр квадрата

        Параметры:
          a(int) : длина стороны квадрата

        Возвращаемое значение:
          perimetr(int) : периметр квадрата

        Пример вызова  :
        perimeter(10) # вернёт 40

    """
    return 4 * a
